<template>
  <div class="programming-story-container">
    <h2 class="programming-story-title">Моя история в программировании</h2>
    <p class="programming-story-text">
      Фронтенд-разработка стала моим любимым занятием из-за магии, которую она приносит в онлайн-мир. Еще до увлечения программированием, я смотрел на айтишников, как на сверх людей. Вот сидит человек, смотрит в монитор, пишет какие-то непонятные символы, и на экране что-то начинает происходить.
      Как он это делает? Неужели он вот реально смотрит на все эти буковки и циферки и может понимать в чем дело? Это же сколько учиться надо и сколько потратить времени, чтобы хоть немного приблизиться к его уровню?
    </p>
    <p class="programming-story-text">
      И вот я решил попробовать сам. Был страх ошибки, страх что для такой профессии нужно родиться гением, и выучиться с 0 либо невозможно, либо почти невозможно. 
      Но тут, html оказался довольно простым. Я очень удивился, когда буквально за вечер, я понял основную суть, и мог уже делать странички. CSS тоже не вызвал огромных трудностей. 
    </p>
    <p class="programming-story-text">
      Перешел к JS. И конечно, совру, если скажу, что было прям «легко». Однако это совсем не так сложно и трудно, как я себе представлял. Узнаешь переменные, функции, как вешать слушатели и постепенно погружаешься глубже в язык. 
      А через время, ты замечаешь, что ты сам уже вот этот человек из первого абзаца. Ты можешь писать код, читать, править и комментировать. А результат появляется у тебя на экране почти мгновенно, разве это не удивительно 😊
    </p>
    <p class="programming-story-text">
      Программирование стало для меня любимым занятием, потому что это свобода действий. Ты можешь создать абсолютно все что ты хочешь. Как пример, меня не устраивало, что на ютубе максимальная скорость просмотра 2x. Тот, кто не знает разработку, скорее бы всего смирился, и вряд ли бы что-то предпринял. Что я сделал? Я написал JS функцию, добавил ее в закладки, и теперь я могу смотреть видео с той скоростью, с какой хочу.
    </p>
    <p class="programming-story-text">
      Вся наша жизнь связана с интернетом и технологиями, и представить себе мир без web’а уже нельзя. Покупки, увлечения, образование – все давно тут.
      И если представить интернет – как дом. А сайты – как квартиры в доме, где большинство просто ходит в гости друг к другу, то мы в этом мире строители, у которых есть и бетономешалка, и цемент, и кран 
    </p>
  </div>
</template>

<script>
export default {
  name: "ProgrammingStory",
};
</script>

<style scoped>
.programming-story-container {
  background-color: white;
  padding: 20px;
  border-radius: 10px;
  box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
  max-width: 600px;
  margin: 20px auto;
}

.programming-story-title {
  color: green;
  font-size: 24px;
  margin-bottom: 10px;
}

.programming-story-text {
  font-size: 16px;
  line-height: 1.5;
  margin-bottom: 20px; 
}
</style>
